#include "mq2.h"
#include "adc.h"
/***************************************************************
* 文件名称: MQ2
* 作    者: 物联网俱乐部
* 版    本: V1.0
* 编写日期: 2018-12-1
* 功    能: 烟感数据采集
****************************************************************
* 硬件平台: 本例程配套物联网俱乐部EVB_L1开发板使用
* 淘    宝: iot-club.taobao.com、https://shop449662000.taobao.com
* 论    坛: www.iot-club.cn 、www.iotclub.net
****************************************************************/

/***************************************************************
* 函数名称: Convert_Smoke
* 说    明: 数值转换
* 参    数: 无
* 返 回 值: 烟感值
***************************************************************/
uint16_t Convert_Smoke(void)
{
	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 100);
	return HAL_ADC_GetValue(&hadc1);
}
